using System;
class Program
{
    static void Main()
    {
        string[] kluby = {"Спартак", "ЦСКА", "Динамо", "Зенит", "Локомотив",
                         "Краснодар", "Ростов", "Ахмат", "Урал", "Крылья Советов",
                         "Сочи", "Нижний Новгород", "Уфа", "Химки", "Тамбов",
                         "Арсенал", "Рубин", "Оренбург", "СКА-Хабаровск", "Тосно"};

        string[] goroda = {"Москва", "Москва", "Москва", "Санкт-Петербург", "Москва",
                          "Краснодар", "Ростов-на-Дону", "Грозный", "Екатеринбург", "Самара",
                          "Сочи", "Нижний Новгород", "Уфа", "Химки", "Тамбов",
                          "Тула", "Казань", "Оренбург", "Хабаровск", "Тосно"};

        for (int i = 0; i < 20; i++)
        {
            Console.WriteLine($"{kluby[i]} - {goroda[i]}");
        }
    }
}