using System;
class Program
{
    static void Main()
    {
        string[] vershiny = {"Эверест", "Аконкагуа", "Мак-Кинли", "Килиманджаро", "Эльбрус",
                            "Монблан", "Казбек", "Белуха", "Джомолунгма", "Чогори",
                            "Канченджанга", "Лхоцзе", "Макалу", "Чо-Ойю", "Дхаулагири"};

        int[] vysoty = {8848, 6962, 6194, 5895, 5642,
                       4810, 5033, 4506, 8848, 8611,
                       8586, 8516, 8485, 8188, 8167};

        Console.WriteLine("Вершины выше 3000 метров:");
        for (int i = 0; i < 15; i++)
        {
            if (vysoty[i] > 3000)
            {
                Console.WriteLine($"{vershiny[i]} - {vysoty[i]} м");
            }
        }
    }
}