using System;
class Program
{
    static void Main()
    {
        int[] knigi = { 2450, 1870, 3120, 1560, 2780, 1940, 3250, 1680, 2910, 2030, 3380, 1790, 3050, 2210, 3520, 1920, 3180, 2340, 3670, 2050, 3310, 2470, 3820, 2180, 3440, 2600, 3970, 2310, 3570, 2730, 4120, 2440, 3700, 2860, 4270 };

        int summa = 0;
        for (int i = 0; i < knigi.Length; i++)
        {
            summa += knigi[i];
        }

        if (summa >= 100000 && summa <= 999999)
        {
            Console.WriteLine("Верно, общее число книг шестизначное");
        }
        else
        {
            Console.WriteLine("Неверно, общее число книг не шестизначное");
        }
    }
}