using System;
class Program
{
    static void Main()
    {
        string[] goroda = {"Рим", "Париж", "Лондон", "Мадрид", "Берлин",
                          "Милан", "Венеция", "Амстердам", "Барселона", "Флоренция",
                          "Вена", "Прага", "Будапешт", "Варшава", "Неаполь",
                          "Стамбул", "Афины", "Стокгольм", "Осло", "Хельсинки",
                          "Турин", "Генуя", "Болонья", "Лион", "Марсель", "Гамбург"};

        string[] strany = {"Италия", "Франция", "Великобритания", "Испания", "Германия",
                          "Италия", "Италия", "Нидерланды", "Испания", "Италия",
                          "Австрия", "Чехия", "Венгрия", "Польша", "Италия",
                          "Турция", "Греция", "Швеция", "Норвегия", "Финляндия",
                          "Италия", "Италия", "Италия", "Франция", "Франция", "Германия"};

        Console.WriteLine("Города в Италии:");
        for (int i = 0; i < 26; i++)
        {
            if (strany[i] == "Италия")
            {
                Console.WriteLine(goroda[i]);
            }
        }
    }
}