using System;
class Program
{
    static void Main()
    {
        float[] magazin1 = { 15000, 18000, 12000, 20000, 17000, 16000, 19000, 14000, 21000, 13000, 22000, 15000, 18000, 17000, 16000, 19000, 20000, 14000, 21000, 13000, 22000, 15000, 18000, 17000, 16000, 19000, 20000, 14000 };
        float[] magazin2 = { 14000, 16000, 13000, 18000, 15000, 17000, 16500, 14500, 17500, 13500, 18500, 15500, 16500, 14500, 17500, 13500, 18500, 15500, 16500, 14500, 17500, 13500, 18500, 15500, 16500, 14500, 17500, 13500 };

        float dohod1 = 0;
        float dohod2 = 0;

        for (int i = 0; i < 28; i++)
        {
            dohod1 += magazin1[i];
            dohod2 += magazin2[i];
        }

        if (dohod1 < dohod2)
        {
            Console.WriteLine($"Первый магазин получил меньше: {dohod1} руб");
        }
        else if (dohod2 < dohod1)
        {
            Console.WriteLine($"Второй магазин получил меньше: {dohod2} руб");
        }
        else
        {
            Console.WriteLine($"Доходы магазинов одинаковы: {dohod1} руб");
        }
    }
}